# Soal 1 - PyMySQL - Sakila Database

## Importing Library and File

In [1]:
import os
import mysql.connector
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Use mysql connector

In [2]:
user_name = os.environ.get('DB_USER')
password = os.environ.get('DB_PASS')

In [3]:
connection = mysql.connector.connect(host = 'localhost',
                                    user = 'root',
                                    passwd = 'root',
                                    db = 'sakila')

In [4]:
connection

## Checking tables from database 'sakila'

In [5]:
sakila_tables = pd.read_sql_query('SHOW TABLES FROM sakila', connection)
sakila_tables

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

## Checking Data from Tables

In [6]:
actor_tables = pd.read_sql_query('SELECT * FROM actor', connection)
actor_info_tables = pd.read_sql_query('SELECT * FROM actor_info', connection)
address_tables = pd.read_sql_query('SELECT * FROM address', connection)
category_tables = pd.read_sql_query('SELECT * FROM category', connection)
city_tables = pd.read_sql_query('SELECT * FROM city', connection)
country_tables = pd.read_sql_query('SELECT * FROM country', connection)
customer_tables = pd.read_sql_query('SELECT * FROM customer', connection)
customer_list_tables = pd.read_sql_query('SELECT * FROM customer_list', connection)
film_tables = pd.read_sql_query('SELECT * FROM film', connection)
film_category_tables = pd.read_sql_query('SELECT * FROM film_category', connection)
rental_tables = pd.read_sql_query('SELECT * FROM rental', connection)
film_actor = pd.read_sql_query('SELECT * FROM film_actor', connection)

In [7]:
actor_tables.head(2)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33
1         2       NICK  WAHLBERG 2006-02-15 04:34:33

In [8]:
film_actor.head(2)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03

In [9]:
film_tables.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42

In [10]:
category_tables.head(2)

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27

In [11]:
film_category_tables.head(2)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09

In [12]:
rental_tables.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

## Query No. 1

In [13]:
no_1 = pd.read_sql_query('''
SELECT film.title, category.name, film.length
FROM film
INNER JOIN film_category ON film.film_id = film_category.film_id
INNER JOIN category ON film_category.category_id = category.category_id
WHERE film_category.category_id = '5'
ORDER BY length
LIMIT 10
''', connection)
no_1

              title    name  length
0   DOWNHILL ENOUGH  Comedy      47
1  PARADISE SABRINA  Comedy      48
2    HEAVEN FREEDOM  Comedy      48
3  HURRICANE AFFAIR  Comedy      49
4        LION UNCUT  Comedy      50
5         ZORRO ARK  Comedy      50
6       CLOSER BANG  Comedy      58
7   AIRPLANE SIERRA  Comedy      62
8   LONELY ELEPHANT  Comedy      67
9      DOOM DANCING  Comedy      68

### Coretan No 1

In [14]:
coretan1 = pd.read_sql_query('''
SELECT * FROM category
WHERE name = 'Comedy'
''', connection)
coretan1

   category_id    name         last_update
0            5  Comedy 2006-02-15 04:46:27

## Query No. 2

In [15]:
no_2 = pd.read_sql_query('''
SELECT category.name as kategori, COUNT(film.film_id) as jumlahMovie, AVG(film.rental_rate) as rataHargaSewa
FROM category
INNER JOIN film_category ON category.category_id = film_category.category_id
INNER JOIN film ON film_category.film_id = film.film_id
GROUP BY kategori
ORDER BY jumlahMovie DESC
''', connection)
no_2

       kategori  jumlahMovie  rataHargaSewa
0        Sports           74       3.125135
1       Foreign           73       3.099589
2        Family           69       2.758116
3   Documentary           68       2.666471
4     Animation           66       2.808182
5        Action           64       2.646250
6           New           63       3.116984
7         Drama           62       3.022258
8         Games           61       3.252295
9        Sci-Fi           61       3.219508
10     Children           60       2.890000
11       Comedy           58       3.162414
12     Classics           57       2.744386
13       Travel           57       3.235614
14       Horror           56       3.025714
15        Music           51       2.950784

## Query No. 3

In [16]:
no_3 = pd.read_sql_query('''
SELECT actor.actor_id, actor.first_name, actor.last_name, COUNT(film.film_id) as jumlah_Movie
FROM actor
INNER JOIN film_actor ON actor.actor_id = film_actor.actor_id
INNER JOIN film ON film_actor.film_id = film.film_id
GROUP BY actor_id
ORDER BY jumlah_Movie DESC
LIMIT 10
''', connection)
no_3

   actor_id first_name  last_name  jumlah_Movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

## Query No. 4

In [17]:
no_4 = pd.read_sql_query('''
SELECT category.name as category, COUNT(film_category.film_id) as jumlah_Movie
FROM category
INNER JOIN film_category ON film_category.category_id = category.category_id
INNER JOIN film_actor ON film_category.film_id = film_actor.film_id
WHERE film_actor.actor_id = '107'
GROUP BY category
''', connection)
no_4

       category  jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

## Query No. 5

In [18]:
no_5 = pd.read_sql_query('''
SELECT film.title, category.name
FROM film
INNER JOIN film_category ON film.film_id = film_category.film_id
INNER JOIN category ON film_category.category_id = category.category_id
INNER JOIN film_actor ON film.film_id = film_actor.film_id
WHERE film_actor.actor_id = '107' AND category.category_id = '14'
''', connection)
no_5

                 title    name
0  CHARIOTS CONSPIRACY  Sci-Fi
1  COLDBLOODED DARLING  Sci-Fi
2       FRISCO FORREST  Sci-Fi
3    GOODFELLAS SALUTE  Sci-Fi
4      LICENSE WEEKEND  Sci-Fi
5         OPEN AFRICAN  Sci-Fi
6  SPIRITED CASUALTIES  Sci-Fi

### Coretan No. 5

In [19]:
coretan5 = pd.read_sql_query('''
SELECT * from category
where name = 'Sci-Fi'
''', connection)
coretan5

   category_id    name         last_update
0           14  Sci-Fi 2006-02-15 04:46:27